

Процедура ПриЗаписи(Отказ)
	
	//Пересчет суммы документа
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭтапПроекта.Ссылка
		|ПОМЕСТИТЬ втЭтапы
		|ИЗ
		|	Документ.ЭтапПроекта КАК ЭтапПроекта
		|ГДЕ
		|	ЭтапПроекта.Проект = &Проект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СебестоимостьОбороты.ПлановаяСтоимостьОборот
		|ИЗ
		|	РегистрНакопления.Себестоимость.Обороты(,,, Этап В
		|		(ВЫБРАТЬ
		|			втЭтапы.Ссылка
		|		ИЗ
		|			втЭтапы КАК втЭтапы)) КАК СебестоимостьОбороты";
	
	Запрос.УстановитьПараметр("Проект", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Сумма = 0;
	Если Выборка.Следующий() Тогда
		Сумма = Выборка.ПлановаяСтоимостьОборот;
	КонецЕсли;
	
КонецПроцедуры
