

Процедура ПриЗаписи(Отказ)
	
	//Пересчет суммы документа
	//TODO: Исправить пересчет суммы при записи документа проект
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭтапПроекта.ПлановаяСтоимость
		|ИЗ
		|	Документ.ЭтапПроекта КАК ЭтапПроекта
		|ГДЕ
		|	ЭтапПроекта.Проект = &Проект
		|	И
		|	НЕ ЭтапПроекта.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Проект", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Сумма = 0;
	Пока Выборка.Следующий() Цикл
		Сумма = Сумма + Выборка.ПлановаяСтоимость;
	КонецЦикла;
	
КонецПроцедуры
