
&НаКлиенте
Процедура СозданиеПараметровВыбораПоИсполнителям()
	СЗ =  ОбщийМодульСервер.ПолучитьСотрудниковОтдела(Объект.Отдел);
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ?(СЗ.Количество()>0,СЗ,Объект.Исполнитель.Пустая()));
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);		
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.Исполнитель.ПараметрыВыбора = НовыеПараметры;
КонецПроцедуры	

&НаКлиенте
Процедура ОтделПриИзменении(Элемент)
	Объект.Исполнитель = Объект.Исполнитель.Пустая();
	СозданиеПараметровВыбораПоИсполнителям();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СозданиеПараметровВыбораПоИсполнителям();
КонецПроцедуры



