&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекПольз = ОбщийМодульСервер.ТекущийПользователь();
	СтатусНовая = Справочники.Статусы.Новое;
	Если  Параметры.Ключ.Пустая() Тогда // если не новый док.
		ТекущийОбъект.Автор = ТекПольз.Сотрудник;
		ТекущийОбъект.ТекущийСтатус =СтатусНовая;
		//Добавить статусы
		НоваяСтрока = ТекущийОбъект.Статусы.Добавить();
		НоваяСтрока.Дата = ТекущаяДата();
		НоваяСтрока.Статус = СтатусНовая;
		НоваяСтрока.Добавил = ТекПольз.Сотрудник;
	КонецЕсли;
	
	//Добавить исполнители
	ТекущийОбъект.ТекущийОтделИсполнитель = ТекущийОбъект.ТекущаяКатегория.Отдел;
	// Если у категории не задан основной исполгитель, то назначаем отвевенного по отделу
	Если ЗначениеЗаполнено(ТекущийОбъект.ТекущаяКатегория.Исполнитель) Тогда
		ТекущийОбъект.ТекущийИсполнитель =  ТекущийОбъект.ТекущаяКатегория.Исполнитель;
	//Иначе	
	//	// Ответсвенный по отделу будет являтся основным исполнителем
	//	ТекущийОбъект.ТекущийИсполнитель = ПолучитьОтветственогоПоОтделу(ТекущийОбъект.ТекущийОтделИсполнитель);
	КонецЕсли;
	
	НоваяСтрока = ТекущийОбъект.Исполнители.Добавить();
	НоваяСтрока.Дата = ТекущаяДата();
	НоваяСтрока.Категория = ТекущийОбъект.ТекущаяКатегория;
	НоваяСтрока.Отдел = ТекущийОбъект.ТекущийОтделИсполнитель;
	НоваяСтрока.Исполнитель  = ТекущийОбъект.ТекущийИсполнитель; 
	НоваяСтрока.Добавил = ТекПольз.Сотрудник;
КонецПроцедуры

&НаСервере
 Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	 Если ЗначениеЗаполнено(АдресВрХранилища) Тогда
		 МассивФайлов =  ПолучитьИзВременногоХранилища(АдресВрХранилища);
		 Для Каждого ИмяФайла Из МассивФайлов Цикл
			 ОбщийМодульСервер.ДобавитьПрисоединенныйФайл(ИмяФайла,ТекущийОбъект.Ссылка);
		 КонецЦикла;
	 КонецЕсли;
 КонецПроцедуры

 &НаКлиенте
 Процедура ПриОткрытии(Отказ)
	ТекПольз = ОбщийМодульСервер.ТекущийПользователь();
	ТипОбращений = ОбщийМодульСервер.ПолучитьНастройкиПользователя(ТекПольз,"ТипПрименяемыхОбращений");
	Отдел = ОбщийМодульСервер.ПолучитьНастройкиПользователя(ТекПольз,"ОтделПоУмолчанию");
	
	Если НЕ ЗначениеЗаполнено(Объект.ОбращениеОт) Тогда 
			Объект.ОбращениеОт = Отдел;
	Иначе
		Если ТипЗнч(Объект.ОбращениеОт) = Тип("СправочникСсылка.Контрагенты") Тогда
			ВидОбращения = ОбщийМодульСервер.ПолучитьВидыОбращений("Внутренние");
		Иначе
			ВидОбращения = ОбщийМодульСервер.ПолучитьВидыОбращений("Внешние");
		КонецЕсли	
	КонецЕсли;
	Если не ЗначениеЗаполнено(Объект.ТекущаяКатегория) Тогда 
		     Объект.ТекущаяКатегория =  ОбщийМодульСервер.ПолучитьНастройкиПользователя(ТекПольз,"КатегорияПоУмолчанию");
			 
	КонецЕсли;		 
	Если не ЗначениеЗаполнено(Объект.ТекущийОтделИсполнитель) Тогда 
		     Объект.ТекущийОтделИсполнитель =  ОбщийМодульСервер.ПолучитьНастройкиПользователя(ТекПольз,"ОтделПоУмолчанию");
			 
	КонецЕсли;		 
	Если НЕ Параметры.Ключ.Пустая() Тогда // если не новый док.
		 Элементы.Файлы.Видимость = Ложь
	 КонецЕсли;	
	 
	Если не ЗначениеЗаполнено(Объект.ТекущийОтделИсполнитель) Тогда 
		     Объект.ТекущийИсполнитель =  ОбщийМодульСервер.ПолучитьНастройкиПользователя(ТекПольз,"ИсполнительПоУмолчанию");
			 
	КонецЕсли;		 

КонецПроцедуры

&НаСервере
Процедура УстановитьОсновнойОтделСотрудника(ТекПольз)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СотрудникиОтделов.Отдел,
	|	СотрудникиОтделов.Сотрудник,
	|	СотрудникиОтделов.ВидМестаРаботы
	|ИЗ
	|	РегистрСведений.СотрудникиОтделов КАК СотрудникиОтделов
	|ГДЕ
	|	СотрудникиОтделов.ВидМестаРаботы = &ВидМестаРаботы
	|	И СотрудникиОтделов.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("ВидМестаРаботы", Перечисления.ВидМестаРаботы.ОсновноеМесто);
	Запрос.УстановитьПараметр("Сотрудник", ТекПольз.Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект.ОбращениеОт = Выборка.Отдел;
		ЗаполнитьКонтактыПоОтделу();
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьОтветственогоПоОтделу(ОтделИсполнитель)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СотрудникиОтделов.Отдел,
	|	СотрудникиОтделов.Сотрудник
	|ИЗ
	|	РегистрСведений.СотрудникиОтделов КАК СотрудникиОтделов
	|ГДЕ
	|	СотрудникиОтделов.Отдел = &Отдел
	|	И СотрудникиОтделов.Ответственный = ИСТИНА";
	
	Запрос.УстановитьПараметр("Отдел", ОтделИсполнитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.ФизическиеЛица.ПустаяСсылка();
	Иначе	
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Сотрудник;
		КонецЦикла;	
	КонецЕсли;
	
КонецФункции	

&НаСервере
Процедура ПриИзмененииОбращениеОтНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	Объект.КонтактноеЛицо = "";
	Объект.Телефон = "";
	ЗаполнитьКонтактыПоОтделу();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры	 

&НаСервере
Процедура ЗаполнитьКонтактыПоОтделу()
	ОтветственныйПоОтделу = ПолучитьОтветственогоПоОтделу(Объект.ОбращениеОт);
	Если ЗначениеЗаполнено(ОтветственныйПоОтделу) Тогда
		Объект.КонтактноеЛицо = ОтветственныйПоОтделу.Наименование;
		ТелОтветст = СокрЛП(ОтветственныйПоОтделу.Телефон);
		Если ЗначениеЗаполнено(Объект.ОбращениеОт.Телефон) Тогда
			Объект.Телефон = СокрЛП(Объект.ОбращениеОт.Телефон)+?(ЗначениеЗаполнено(ТелОтветст),"; "+ТелОтветст,"");
		Иначе
			Объект.Телефон = ТелОтветст;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры	 

&НаКлиенте
Процедура ОбращениеОтПриИзменении(Элемент)
	ПриИзмененииОбращениеОтНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПрисоединитьФайлы(Команда)
	#Если ВебКлиент Тогда
		ДопПараметры = Новый Структура;
		Оповещение = Новый ОписаниеОповещения("ПрисоединитьФайлыВВводНового", ЭтаФорма,ДопПараметры);
		
		ОбщийМодульКлиент.ПроверитьПодключениеРасширения(Оповещение);
	#Иначе  
		ПрисоединитьФайлыВыполнить();
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПрисоединитьФайлыВВводНового(Действия,ДопПараметры) Экспорт
	 ПрисоединитьФайлыВыполнить();
КонецПроцедуры

&НаКлиенте
 Процедура ПрисоединитьФайлыВыполнить()
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	//Фильтр = НСтр("ru = 'Текст'; en = 'Text'")
	//    + "(*.txt)|*.txt";
	//ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Истина;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ПрисоединитьФайлыЗавершение", ЭтотОбъект, Новый Структура("ДиалогОткрытияФайла", ДиалогОткрытияФайла)));
КонецПроцедуры	 

 &НаКлиенте
 Процедура ПрисоединитьФайлыЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
     
     ДиалогОткрытияФайла = ДополнительныеПараметры.ДиалогОткрытияФайла;
          
     Если (ВыбранныеФайлы <> Неопределено) Тогда
         МассивФайлов = Новый Массив;
         МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
         АдресВрХранилища = ПоместитьВоВременноеХранилище(МассивФайлов);
         Элементы.Файлы.Заголовок =  "Присоединить файлы " + "("+МассивФайлов.Количество()+")" 
     КонецЕсли;

КонецПроцедуры

&НаКлиенте
 Процедура ТекущаяКатегорияПриИзменении(Элемент)
	 // Заполним заголовок обращения из категории если он не заполнен
	 Если НЕ ЗначениеЗаполнено(Объект.Заголовок) Тогда
		  ЗаполнитьЗаголовокОбращенияИзКатегории(); 
	 КонецЕсли;	 
 КонецПроцедуры
 
 &НаСервере
Процедура ЗаполнитьЗаголовокОбращенияИзКатегории()
	 Объект.Заголовок =  Объект.ТекущаяКатегория.Заголовок;
КонецПроцедуры


&НаКлиенте
Процедура ТекущийИсполнительПриИзменении(Элемент)
	Объект.РеальныйИсполнитель = Объект.ТекущийИсполнитель;
КонецПроцедуры
 
