// Процедура формирования движений по регистру "Себестоимость".
//
// Параметры:
//  ДополнительныеСвойства - Структура - Структура дополнительных свойств для проведения.
//  Движения - Структура - Структура наборов движений документа.
//  Отказ - Булево - Признак отказа от проведения документа.
//
Процедура ОтразитьВзаиморасчеты(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаВзаиморасчеты = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВзаиморасчетыСКлиентами;
	
	Если Отказ ИЛИ ТаблицаВзаиморасчеты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВзаиморасчеты = Движения.ВзаиморасчетыСКлиентами;
	ДвиженияВзаиморасчеты.Записывать = Истина;
	ДвиженияВзаиморасчеты.Загрузить(ТаблицаВзаиморасчеты);
	
КонецПроцедуры

