
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Если значение отдел установлено, то редактирование запрещено
	Если ЗначениеЗаполнено(Запись.Отдел) Тогда
		 Элементы.Отдел.ТолькоПросмотр = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Проверим записанные данные по местам работы
	Если Запись.ВидМестаРаботы = Перечисления.ВидМестаРаботы.ОсновноеМесто Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиОтделов.Отдел,
		|	СотрудникиОтделов.Сотрудник,
		|	СотрудникиОтделов.ВидМестаРаботы
		|ИЗ
		|	РегистрСведений.СотрудникиОтделов КАК СотрудникиОтделов
		|ГДЕ
		|   НЕ СотрудникиОтделов.Отдел = &Отдел
		|	И СотрудникиОтделов.ВидМестаРаботы = &ВидМестаРаботы
		|	И СотрудникиОтделов.Сотрудник = &Сотрудник";
		
		Запрос.УстановитьПараметр("Отдел", Запись.Отдел);
		Запрос.УстановитьПараметр("ВидМестаРаботы", Запись.ВидМестаРаботы);
		Запрос.УстановитьПараметр("Сотрудник", Запись.Сотрудник);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ОбщийМодульКлиентСервер.СообщитьПользователю("У "+Выборка.Сотрудник+" основным местом работы является "+Выборка.Отдел);
			Отказ = Истина;
			Прервать;
		КонецЦикла;
	КонецЕсли;	 
	
	// Проверим записанные данные по принадлежности к основному исполнителю
	Если Запись.Ответственный Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиОтделов.Отдел,
		|	СотрудникиОтделов.Сотрудник
		|ИЗ
		|	РегистрСведений.СотрудникиОтделов КАК СотрудникиОтделов
		|ГДЕ
		|	СотрудникиОтделов.Отдел = &Отдел
		|	И СотрудникиОтделов.Ответственный = ИСТИНА";
		
		Запрос.УстановитьПараметр("Отдел", Запись.Отдел);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ОбщийМодульКлиентСервер.СообщитьПользователю(Выборка.Сотрудник.Наименование+" уже назначен ответственным в текущем отделе.");
			Отказ = Истина;
			Прервать;
		КонецЦикла
	КонецЕсли;	

	

КонецПроцедуры
