
&НаКлиенте
Процедура ДобавитьТекущегоПользователя(Команда)
	ДобавитьТекущегоПользователяНаСервере();
	Роль = НайтиРолиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьТекущегоПользователяНаСервере()
	// Вставить содержимое обработчика.
	Объект.Наименование = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	Объект.ИдентификаторПользователяИБ = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Роль = НайтиРолиНаСервере();
КонецПроцедуры

&НаСервере
Функция НайтиРолиНаСервере()
	//Вставить содержимое обработчика
	ПользовательПоиска = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.ИдентификаторПользователяИБ);
	СЗ = Новый СписокЗначений;
	Если НЕ ПользовательПоиска = Неопределено Тогда
		Для Каждого Стр Из ПользовательПоиска.Роли Цикл
			 СЗ.Добавить(Стр.Синоним);
		КонецЦикла;	
	КонецЕсли;	
	 Возврат СЗ
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ЭтоНовый() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.ИдентификаторПользователяИБ,
		|	Пользователи.Наименование
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ИдентификаторПользователяИБ = &ИПБ";
		
		Запрос.УстановитьПараметр("ИПБ",ТекущийОбъект.ИдентификаторПользователяИБ);
		
		Если Не Запрос.Выполнить().Пустой() Тогда
			Отказ = Истина;
			Сообщить("Такой пользователь уже существует.");
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоИмениНаСервере()
	НайденныйПользователь =  ПользователиИнформационнойБазы.НайтиПоИмени(Объект.Наименование);
	Если Не НайденныйПользователь = Неопределено Тогда
		Объект.ИдентификаторПользователяИБ = НайденныйПользователь.УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоИмени(Команда)
	ЗаполнитьПоИмениНаСервере();
	Роль = НайтиРолиНаСервере();
КонецПроцедуры




