
Процедура ПриНачалеРаботыСистемы()
	
	Если ОбщийМодульСервер.ПолучитьНастройкиПользователя(ОбщийМодульСервер.ТекущийПользователь(),"АвтоОткрытииРабочегоСтолаОбращений") Тогда
		ОткрытьФорму("Обработка.РабочийСтолОбращенийТП.Форма.Форма", , ,);
	КонецЕсли;	
	
	
	ОбщийМодульСервер.ВключитьЗаданиеЗагрузкаОбращенийПоEmail();
	
	// Запуск стартового помощника
	ЗапускСтартовогоПомощника = ОбщийМодульСервер.ЗапускСтартовогоПомощника(); 
	Если  ЗапускСтартовогоПомощника = "Возможно" Тогда 
		ОткрытьФорму("Обработка.СтартовыйПомощник.Форма.Форма",,,);
	ИначеЕсли ЗапускСтартовогоПомощника = "НетДоступа" Тогда	
		ОбщийМодульКлиентСервер.СообщитьПользователю("Запуск стартового помощника возможен только под правами администратора.");
	КонецЕсли;	  

	
КонецПроцедуры



