#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	Перем ИДПользователя, ИмяПользователя ,СпрПользователейДляПоиска,СсылкаНаНайденногоПользователя;
	//Если НЕ ИменаПараметровСеанса=Неопределено Тогда
		СпрПользователейДляПоиска=Справочники.Пользователи;
		ИДПользователя=ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
		ИмяПользователя=ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
		
		СсылкаНаНайденногоПользователя = СпрПользователейДляПоиска.НайтиПоРеквизиту("ИдентификаторПользователяИБ",ИДПользователя);
		Если  СсылкаНаНайденногоПользователя = СпрПользователейДляПоиска.ПустаяСсылка() Тогда
			  НовыйЭлемент = СпрПользователейДляПоиска.СоздатьЭлемент();
			  Если ЗначениеЗаполнено(ИмяПользователя) Тогда
				  НовыйЭлемент.Наименование = ИмяПользователя;
			  иначе
				  НовыйЭлемент.Наименование = "<Не определен>";
			  КонецЕсли;
			  НовыйЭлемент.ИдентификаторПользователяИБ = ИДПользователя;
			  НовыйЭлемент.НастройкиПользователя = Справочники.НастройкиПользователей.СтандартныеНастройки;
			  НовыйЭлемент.Записать();
			 			  
		Иначе	
			ПараметрыСеанса.ТекущийПользователь= СсылкаНаНайденногоПользователя;
		КонецЕсли
	//КонецЕсли;
		
КонецПроцедуры

#КонецЕсли