
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("ИменаМакетов, ИмяМенеджераПечати, ПараметрКоманды, ПараметрыПечати, Закрыть", 
		"ЛистУчетаРабочегоВремени", "Документ.РасчетыПоРаботам", ПараметрКоманды, Неопределено, Истина);
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
