
//&НаКлиенте
//Процедура ЦветПриИзменении(Элемент)
//	Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
//	ОбъектXDTO = Сериализатор.ЗаписатьXDTO(Цвет);
//	ЗаписьXML = Новый ЗаписьXML; 
//	ЗаписьXML.УстановитьСтроку(); 
//	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO); 
//	СтрокаXML = ЗаписьXML.Закрыть();
//	
//	Объект.ЦветСтроки =  СтрокаXML;
//	//ЗаписьXML.Закрыть();
//КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ Параметры.Ключ.Пустая() Тогда
		ЗаполнитьЦветСтроки();
		ЗаполнитьЦветСтрокиПриПревышении();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦветСтрокиПриИзменении(Элемент)
	    ЗаполнитьЦветСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ЦветСтрокиПриПревышенииПриИзменении(Элемент)
	ЗаполнитьЦветСтрокиПриПревышении();
КонецПроцедуры

Процедура ЗаполнитьЦветСтроки()
	ЗначенияСтиляСтроки = ОбщийМодульСервер.ПолучитьЦветаСтрок(Объект.ЦветСтроки);
	Элементы.ЦветСтроки.ЦветФона = ЗначенияСтиляСтроки.ЦветСтроки;
	Элементы.ЦветСтроки.ЦветТекста = ЗначенияСтиляСтроки.ЦветШрифта;
КонецПроцедуры	

Процедура ЗаполнитьЦветСтрокиПриПревышении()
	ЗначенияСтиляСтроки = ОбщийМодульСервер.ПолучитьЦветаСтрок(Объект.ЦветСтрокиПриПревышении);
	Элементы.ЦветСтрокиПриПревышении.ЦветФона = ЗначенияСтиляСтроки.ЦветСтроки;
	Элементы.ЦветСтрокиПриПревышении.ЦветТекста = ЗначенияСтиляСтроки.ЦветШрифта;
КонецПроцедуры	


