&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Закрывать") Тогда
	    Закрывать = Параметры.Закрывать;
	Иначе
	    Закрывать = Ложь;
	КонецЕсли;
	
	Копий = ПечатнаяФормаОбразец.КоличествоЭкземпляров;
	Элементы.КнопкаРедактирование.Пометка = Элементы.ПечатнаяФормаОбразец.Редактирование;
	
	СформироватьПечатныеФормы();
	
	Если ПечатнаяФормаОбразец.ВысотаТаблицы = 0 Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПечатнаяФормаНедоступна;
		Элементы.КнопкаПечатьКоманднаяПанель.Видимость = Ложь;
		Элементы.КнопкаПечатьВсеДействия.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьПечатныеФормы()
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(Параметры.ИмяМенеджераПечати);
	Менеджер.Печать(Параметры.ПараметрКоманды, Параметры.ПараметрыПечати, Параметры.ИменаМакетов, ПечатнаяФормаОбразец);
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ПечатнаяФормаОбразец.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
	
	Если Закрывать Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КопийПриИзменении(Элемент)
	ПечатнаяФормаОбразец.КоличествоЭкземпляров = Копий;
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьРедактирование(Команда)
	Элементы.ПечатнаяФормаОбразец.Редактирование = НЕ Элементы.ПечатнаяФормаОбразец.Редактирование;
	Элементы.КнопкаРедактирование.Пометка = Элементы.ПечатнаяФормаОбразец.Редактирование;
КонецПроцедуры