
&НаКлиенте
Процедура ЗагружатьОбращенияПоEmailПриИзменении(Элемент)
	УстановитьДоступностьЭлементаЗагрузкаОбращенийУчетнаяЗапись();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьЭлементаЗагрузкаОбращенийУчетнаяЗапись();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементаЗагрузкаОбращенийУчетнаяЗапись()
	Элементы.ЗагрузкаОбращенийУчетнаяЗапись.Доступность = НаборКонстант.ЗагружатьОбращенияПоEmail;
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Проверим заполнена ли ЗагрузкаОбращенийУчетнаяЗапись 
	Если НаборКонстант.ЗагружатьОбращенияПоEmail Тогда
		Если НЕ ЗначениеЗаполнено(НаборКонстант.ЗагрузкаОбращенийУчетнаяЗаписьПочты) Тогда
			Сообщить("Не заполнена <Учетная запись автозагрузки обращений>");
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбщийМодульСервер.ВключитьЗаданиеЗагрузкаОбращенийПоEmail();
КонецПроцедуры


