
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОформлениеНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОформлениеНаСервере()
	
	ЭтаФорма.УсловноеОформление.Элементы.Очистить();
	Для Каждого СтрЦвета из Перечисления.ЦветаСтрок Цикл
		ЗначенияСтиляСтроки = ОбщийМодульСервер.ПолучитьЦветаСтрок(СтрЦвета);
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦветСтроки");
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ЦветСтроки");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = СтрЦвета;
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЗначенияСтиляСтроки.ЦветСтроки);
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЗначенияСтиляСтроки.ЦветШрифта);
	КонецЦикла;
КонецПроцедуры


