

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьИПродолжить(Команда)
	
	Оповещение = Новый ОписаниеОповещения("УстановитьИПродолжитьЗавершение", ЭтотОбъект);
	НачатьУстановкуРасширенияРаботыСФайлами(Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьИПродолжитьЗавершение(ДополнительныеПараметры) Экспорт
	
	ОповещениеПодключения = Новый ОписаниеОповещения("ПодключеноРасширение",ЭтотОбъект);
	НачатьПодключениеРасширенияРаботыСФайлами(ОповещениеПодключения);

	
КонецПроцедуры

Процедура ПодключеноРасширение(Подключено,ДопПараметры) Экспорт
	
	Закрыть(?(Подключено, "Подключено",""));
	
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьФормуУстановки(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти
