
&НаКлиенте
Процедура ОтветДа(Команда)
	ДопПараметры = ЭтаФорма.ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры;
	ДопПараметры.Вставить("ОтветНаВопрос","Да");
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтветНет(Команда)
	ДопПараметры = ЭтаФорма.ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры;
	ДопПараметры.Вставить("ОтветНаВопрос","Нет");
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДопПараметры = ЭтаФорма.ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры;
	ТекстВопроса = ДопПараметры.ТекстВопроса;
	ЭтаФорма.Заголовок = ДопПараметры.ТекстЗаголовка;
КонецПроцедуры
