// Процедура формирования движений по регистру "Себестоимость".
//
// Параметры:
//  ДополнительныеСвойства - Структура - Структура дополнительных свойств для проведения.
//  Движения - Структура - Структура наборов движений документа.
//  Отказ - Булево - Признак отказа от проведения документа.
//
Процедура ОтразитьСебестоимость(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаСебестоимость = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСебестоимость;
	
	Если Отказ ИЛИ ТаблицаСебестоимость.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСебестоимость = Движения.Себестоимость;
	ДвиженияСебестоимость.Записывать = Истина;
	ДвиженияСебестоимость.Загрузить(ТаблицаСебестоимость);
	
КонецПроцедуры

