
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Тема", "Проверка почты");
	ПараметрыПисьма.Вставить("Тело", "Проверка учетной записи");
	ПараметрыПисьма.Вставить("Кому", ПолучитьАдресПочтыТекущейЗаписи(ПараметрКоманды));
	
	ПараметрыЗагрузки = Новый Структура;
	
	
	Попытка 
		ОтправитьСообщение(ПараметрКоманды, ПараметрыПисьма);
		ОбщийМодульКлиентСервер.СообщитьПользователю("Сообщение успешно отправлено.",,,,Истина);
	Исключение
		ОбщийМодульКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), , , , Истина);
	КонецПопытки;
	
	Попытка 
		ПолучитьСообщение(ПараметрКоманды,ПараметрыЗагрузки);		
	Исключение
		ОбщийМодульКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), , , , Истина);
	КонецПопытки;


	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресПочтыТекущейЗаписи(Параметр)
	Возврат Параметр.АдресЭлектроннойПочты;
КонецФункции	

&НаСервере
Процедура ОтправитьСообщение(УчетнаяЗапись, ПараметрыПисьма)
	РаботаСЭлектроннойПочтой.ОтправитьСообщение(УчетнаяЗапись, ПараметрыПисьма);	
КонецПроцедуры	

&НаСервере
Процедура  ПолучитьСообщение(УчетнаяЗапись,ПараметрыЗагрузки)
	ТаблицаВходящихСообщений = РаботаСЭлектроннойПочтой.ЗагрузитьСообщения(УчетнаяЗапись,ПараметрыЗагрузки);
	Для Каждого Элемент Из ТаблицаВходящихСообщений Цикл
		ОбщийМодульКлиентСервер.СообщитьПользователю("Сообщение от: <"+Элемент.ИмяОтправителя+">, тема: <"+Элемент.Тема +"> успешно получено.",,,,Истина);
	КонецЦикла;
КонецПроцедуры	

