
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОграниченияПоОрганизациямПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()

	Элементы.ГруппаОрганизации.Видимость  = Объект.ОграниченияПоОтделам;
	Элементы.ГруппаСотрудники.Видимость   = Объект.ОграниченияПросмотраСотрудников;

КонецПроцедуры // УстановитьВидимость()

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда 
		
		Объект.Наименование = Объект.Пользователь;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОграничитьПросмотрИсполнителяПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры
